In [8]:
import sqlite3
import pandas as pd

Creo una conexion y una tabla

In [9]:
conexion=sqlite3.connect("bd1.db")

In [10]:
try:
    conexion.execute("""create table prueba (
                                ID integer primary key autoincrement,
                                descripcion text,
                                precio real
                        )""")
except:
    pass

In [14]:
tabla=[["naranjas", 23.50],["peras", 34],["bananas", 25]]
for linea in tabla:
    conexion.execute("insert into prueba(descripcion,precio) values (?,?)", linea)
conexion.commit()

In [15]:
df = pd.read_sql_query("SELECT * FROM prueba", conexion)
df

    ID descripcion  precio
0    1    naranjas    23.5
1    2       peras    34.0
2    3     bananas    25.0
3    4    naranjas    23.5
4    5       peras    34.0
5    6     bananas    25.0
6    7    naranjas    23.5
7    8       peras    34.0
8    9     bananas    25.0
9   10    naranjas    23.5
10  11       peras    34.0
11  12     bananas    25.0

In [6]:
conexion.close()